{
  "introduction.title": "How Cloud Computing Works",
  "@introduction.title": {
    "description": "Main heading for the introduction screen of the interactive cloud computing tutorial"
  },
  "introduction.description": "This short, interactive activity will guide you through the methods and techniques of the cloud, from its foundations to its deployment.",
  "@introduction.description": {
    "description": "Brief description of what the user will learn in this activity"
  },
  "introduction.part1.title": "Part 1: Foundations.",
  "@introduction.part1.title": {
    "description": "Title for the first learning section about cloud computing basics"
  },
  "introduction.part1.description": "Tackle 'Myth vs. Fact' questions about what the cloud really is.",
  "@introduction.part1.description": {
    "description": "Description of the first activity - a quiz format about cloud fundamentals"
  },
  "introduction.part2.title": "Part 2: Service Models.",
  "@introduction.part2.title": {
    "description": "Title for the second learning section about cloud service types"
  },
  "introduction.part2.description": "Play a drag-and-drop game to sort IaaS, PaaS, and SaaS.",
  "@introduction.part2.description": {
    "description": "Description of the second activity - interactive sorting game. IaaS, PaaS, and SaaS are technical acronyms that should not be translated"
  },
  "introduction.part3.title": "Part 3: Deployment Models.",
  "@introduction.part3.title": {
    "description": "Title for the third learning section about cloud deployment types"
  },
  "introduction.part3.description": "Solve real-world scenarios to understand Public, Private, and Hybrid clouds.",
  "@introduction.part3.description": {
    "description": "Description of the third activity - scenario-based learning about deployment types"
  },
  "introduction.button.start": "Let's Get Started",
  "@introduction.button.start": {
    "description": "Call-to-action button to begin the learning activity"
  },
  "part1.title": "Part 1: The Foundation",
  "@part1.title": {
    "description": "Header for the foundation quiz section"
  },
  "part1.subtitle": "Is the following statement a myth or a fact?",
  "@part1.subtitle": {
    "description": "Instruction text explaining the quiz format to users"
  },
  "part1.button.fact": "Fact",
  "@part1.button.fact": {
    "description": "Button label for selecting that a statement is true/factual"
  },
  "part1.button.myth": "Myth",
  "@part1.button.myth": {
    "description": "Button label for selecting that a statement is false/myth"
  },
  "part1.feedback.correct.title": "Correct!",
  "@part1.feedback.correct.title": {
    "description": "Positive feedback shown when user selects the right answer"
  },
  "part1.feedback.incorrect.title": "Not Quite!",
  "@part1.feedback.incorrect.title": {
    "description": "Gentle feedback shown when user selects the wrong answer"
  },
  "part1.button.next": "Next Question",
  "@part1.button.next": {
    "description": "Button to proceed to the next quiz question"
  },
  "part1.button.continue": "Continue",
  "@part1.button.continue": {
    "description": "Button to proceed to next section after completing all questions"
  },
  "part1.question1.statement": "The foundations of cloud computing are high-powered computers called servers, located in facilities called data centers.",
  "@part1.question1.statement": {
    "description": "Quiz statement about the physical infrastructure of cloud computing"
  },
  "part1.question1.explanation": "That's right! The cloud's central innovation is placing large numbers of servers in data centers, typically located far from the individuals and organizations that access them.",
  "@part1.question1.explanation": {
    "description": "Educational explanation shown after answering the question correctly or incorrectly"
  },
  "part1.question2.statement": "Cloud computing requires organizations to buy and operate their own computer equipment on-premises.",
  "@part1.question2.statement": {
    "description": "Quiz statement about cloud vs on-premises computing"
  },
  "part1.question2.explanation": "Exactly. Historically, organizations operated their own on-premises equipment. Cloud computing allows them to access resources remotely from a cloud provider instead.",
  "@part1.question2.explanation": {
    "description": "Educational explanation about the evolution from on-premises to cloud computing"
  },
  "part2.title": "Part 2: Service Models",
  "@part2.title": {
    "description": "Header for the service models sorting game section"
  },
  "part2.subtitle": "Drag each example to the correct service model category.",
  "@part2.subtitle": {
    "description": "Instruction for the drag-and-drop interaction"
  },
  "part2.examples.title": "Examples",
  "@part2.examples.title": {
    "description": "Label for the list of examples that users will drag and drop"
  },
  "part2.feedback.correct.title": "Correct!",
  "@part2.feedback.correct.title": {
    "description": "Positive feedback when user places example in correct category"
  },
  "part2.feedback.incorrect.title": "Not Quite...",
  "@part2.feedback.incorrect.title": {
    "description": "Gentle feedback when user places example in wrong category"
  },
  "part2.feedback.button.gotit": "Got it",
  "@part2.feedback.button.gotit": {
    "description": "Button to dismiss feedback modal and try again"
  },
  "part2.allsorted.message": "All items sorted correctly!",
  "@part2.allsorted.message": {
    "description": "Success message shown when all examples are correctly categorized"
  },
  "part2.button.continue": "Continue",
  "@part2.button.continue": {
    "description": "Button to proceed to next section after completing sorting"
  },
  "part2.example1.text": "Paying for storage space that automatically scales to match the amount of data in use.",
  "@part2.example1.text": {
    "description": "Example of cloud storage service for categorization exercise"
  },
  "part2.example1.correct": "You got it. Scalable storage is a core component of infrastructure that you rent from a provider. This is a classic IaaS offering.",
  "@part2.example1.correct": {
    "description": "Explanation when correctly categorized as IaaS (Infrastructure as a Service)"
  },
  "part2.example1.hint.paas": "While a PaaS application would *use* storage, the storage service itself is a more fundamental building block. It's part of the core infrastructure.",
  "@part2.example1.hint.paas": {
    "description": "Hint shown when user incorrectly categorizes as PaaS instead of IaaS"
  },
  "part2.example1.hint.saas": "This isn't a complete application, but a raw component you'd use to build one. Which model provides these fundamental building blocks?",
  "@part2.example1.hint.saas": {
    "description": "Hint shown when user incorrectly categorizes as SaaS instead of IaaS"
  },
  "part2.example2.text": "Using Zoom for video calls or Slack for messaging.",
  "@part2.example2.text": {
    "description": "Example of ready-to-use software applications. Zoom and Slack are product names that should not be translated"
  },
  "part2.example2.correct": "That's it! These are examples of complete software products that you access, typically by paying a subscription. This is Software as a Service.",
  "@part2.example2.correct": {
    "description": "Explanation when correctly categorized as SaaS (Software as a Service)"
  },
  "part2.example2.hint.iaas": "With Zoom or Slack, are you managing servers or just using an app? IaaS is about renting the servers themselves. This is a level above that.",
  "@part2.example2.hint.iaas": {
    "description": "Hint shown when user incorrectly categorizes as IaaS instead of SaaS. Zoom and Slack should not be translated"
  },
  "part2.example2.hint.paas": "PaaS is a platform for developers to *create* apps. Zoom is an app that has already been created for you to use. Which model fits that description?",
  "@part2.example2.hint.paas": {
    "description": "Hint shown when user incorrectly categorizes as PaaS instead of SaaS. Zoom should not be translated"
  },
  "part2.example3.text": "Operating your own software in the cloud while a provider handles and maintains the servers.",
  "@part2.example3.text": {
    "description": "Example of platform service for running custom applications"
  },
  "part2.example3.correct": "Perfect! With PaaS, you focus on your application code, while the provider handles the underlying infrastructure and technical responsibilities, like server maintenance.",
  "@part2.example3.correct": {
    "description": "Explanation when correctly categorized as PaaS (Platform as a Service)"
  },
  "part2.example3.hint.iaas": "You're getting warmer! IaaS would give you the server, but you would be responsible for maintaining it. This service handles that maintenance for you.",
  "@part2.example3.hint.iaas": {
    "description": "Hint shown when user incorrectly categorizes as IaaS instead of PaaS"
  },
  "part2.example3.hint.saas": "This is a model for *running* your own software, not for *using* someone else's. Which category provides that kind of platform?",
  "@part2.example3.hint.saas": {
    "description": "Hint shown when user incorrectly categorizes as SaaS instead of PaaS"
  },
  "part2.example4.text": "Accessing a file sharing service to collaborate with a team.",
  "@part2.example4.text": {
    "description": "Example of collaboration software for teams"
  },
  "part2.example4.correct": "Correct! A file sharing service is a ready-to-use application provided for end-users, which is the definition of SaaS.",
  "@part2.example4.correct": {
    "description": "Explanation when correctly categorized as SaaS"
  },
  "part2.example4.hint.iaas": "File sharing is a feature of a complete software product. IaaS would be renting the raw storage where those files are kept.",
  "@part2.example4.hint.iaas": {
    "description": "Hint shown when user incorrectly categorizes as IaaS instead of SaaS"
  },
  "part2.example4.hint.paas": "You are *using* a finished service, not *building* one. PaaS is the environment for building. What's the model for using?",
  "@part2.example4.hint.paas": {
    "description": "Hint shown when user incorrectly categorizes as PaaS instead of SaaS"
  },
  "part2.example5.text": "Using a provider's infrastructure for large-scale data processing and analytics.",
  "@part2.example5.text": {
    "description": "Example of infrastructure service for data processing"
  },
  "part2.example5.correct": "Exactly! You are renting the provider's fundamental computing resources (their infrastructure) to perform complex tasks. This is IaaS.",
  "@part2.example5.correct": {
    "description": "Explanation when correctly categorized as IaaS"
  },
  "part2.example5.hint.paas": "PaaS provides a managed platform, but when you're directly utilizing raw processing power and storage for custom analytics, you're using the underlying infrastructure.",
  "@part2.example5.hint.paas": {
    "description": "Hint shown when user incorrectly categorizes as PaaS instead of IaaS"
  },
  "part2.example5.hint.saas": "This describes using core computing power, not a specific, pre-built software application. Which model is about renting raw resources?",
  "@part2.example5.hint.saas": {
    "description": "Hint shown when user incorrectly categorizes as SaaS instead of IaaS"
  },
  "part2.example6.text": "Hosting your company's custom application and its business analytics tools.",
  "@part2.example6.text": {
    "description": "Example of platform for hosting custom business applications"
  },
  "part2.example6.correct": "That's right. When you deploy and run your own software and tools on a managed environment from a cloud provider, that's Platform as a Service.",
  "@part2.example6.correct": {
    "description": "Explanation when correctly categorized as PaaS"
  },
  "part2.example6.hint.iaas": "You could do this with IaaS, but you'd also have to manage the operating systems and servers. PaaS handles that for you so you can focus on your app.",
  "@part2.example6.hint.iaas": {
    "description": "Hint shown when user incorrectly categorizes as IaaS instead of PaaS"
  },
  "part2.example6.hint.saas": "This is about running your *own* custom application, not subscribing to one made by someone else. Which model provides a platform for your own software?",
  "@part2.example6.hint.saas": {
    "description": "Hint shown when user incorrectly categorizes as SaaS instead of PaaS"
  },
  "part2.hint.default": "That doesn't seem to be the right fit. Think about the level of management provided by the service.",
  "@part2.hint.default": {
    "description": "Generic fallback hint for any incorrect categorization"
  },
  "part2.tap.place": "Tap here to place",
  "@part2.tap.place": {
    "description": "Instruction shown in category boxes when a card is selected (for touch/mobile users)"
  },
  "part3.title": "Part 3: Deployment Models",
  "@part3.title": {
    "description": "Header for the deployment models scenario section"
  },
  "part3.subtitle": "Read the scenario and choose the most appropriate cloud model.",
  "@part3.subtitle": {
    "description": "Instruction for the scenario-based questions"
  },
  "part3.feedback.correct.title": "Correct!",
  "@part3.feedback.correct.title": {
    "description": "Positive feedback for selecting the right deployment model"
  },
  "part3.feedback.incorrect.title": "Good Try!",
  "@part3.feedback.incorrect.title": {
    "description": "Encouraging feedback for incorrect answer"
  },
  "part3.button.next": "Next Scenario",
  "@part3.button.next": {
    "description": "Button to proceed to next scenario question"
  },
  "part3.button.finish": "Finish Activity",
  "@part3.button.finish": {
    "description": "Button to complete the final section and view results"
  },
  "part3.scenario1.text": "A financial firm needs to store proprietary research with greater security, requiring an encrypted VPN connection for its employees to access it.",
  "@part3.scenario1.text": {
    "description": "Business scenario about secure financial data storage. VPN is a technical acronym (Virtual Private Network)"
  },
  "part3.scenario1.explanation": "A Private Cloud is ideal here. It offers the greatest security by imposing more restrictions on access, making it suitable for sensitive information like financial records or proprietary research.",
  "@part3.scenario1.explanation": {
    "description": "Explanation of why Private Cloud is the correct choice for this security-focused scenario"
  },
  "part3.scenario2.text": "A software company wants to deploy its app for nearly any customer to use, with easy access over standard internet connections and lower costs.",
  "@part3.scenario2.text": {
    "description": "Business scenario about wide public accessibility and cost efficiency"
  },
  "part3.scenario2.explanation": "A Public Cloud is the perfect choice. They are called 'public' because nearly any customer can pay to use their servers, making them cheaper and offering easy access.",
  "@part3.scenario2.explanation": {
    "description": "Explanation of why Public Cloud suits mass accessibility and cost considerations"
  },
  "part3.scenario3.text": "A company runs its videoconferencing software on a public cloud but stores its sensitive customer service records in a separate, more secure environment.",
  "@part3.scenario3.text": {
    "description": "Business scenario about splitting workloads between different cloud types"
  },
  "part3.scenario3.explanation": "This is a classic Hybrid Cloud. This model involves splitting data and applications across public and private clouds to combine the benefits of both.",
  "@part3.scenario3.explanation": {
    "description": "Explanation of Hybrid Cloud's ability to combine public and private infrastructures"
  },
  "part3.explanation.default": "That's a good thought, but there's a better fit. Consider the key requirements of the scenario.",
  "@part3.explanation.default": {
    "description": "Generic feedback for incorrect deployment model selection"
  },
  "summary.title": "Great Job!",
  "@summary.title": {
    "description": "Congratulatory heading on completion screen"
  },
  "summary.description": "You've completed the introduction to how cloud computing works. Here's a quick recap of what you learned.",
  "@summary.description": {
    "description": "Introduction to the summary/recap section"
  },
  "summary.recap.foundations.title": "Foundations:",
  "@summary.recap.foundations.title": {
    "description": "Section header for cloud computing basics recap"
  },
  "summary.recap.foundations.text": "The cloud is a physical network of servers in data centers, accessed remotely.",
  "@summary.recap.foundations.text": {
    "description": "Summary of cloud computing fundamentals"
  },
  "summary.recap.servicemodels.title": "Service Models:",
  "@summary.recap.servicemodels.title": {
    "description": "Section header for service models recap"
  },
  "summary.recap.iaas": "- IaaS is renting a provider's cloud infrastructure (servers, storage).",
  "@summary.recap.iaas": {
    "description": "Full recap item for IaaS including bullet marker. IaaS is an acronym for Infrastructure as a Service - translate the words but keep the acronym"
  },
  "summary.recap.paas": "- PaaS is a platform to operate your own software on, where the provider handles the servers.",
  "@summary.recap.paas": {
    "description": "Full recap item for PaaS including bullet marker. PaaS is an acronym for Platform as a Service - translate the words but keep the acronym"
  },
  "summary.recap.saas": "- SaaS is paying to access another organization's ready-to-use software.",
  "@summary.recap.saas": {
    "description": "Full recap item for SaaS including bullet marker. SaaS is an acronym for Software as a Service - translate the words but keep the acronym"
  },
  "summary.recap.deploymentmodels.title": "Deployment Models:",
  "@summary.recap.deploymentmodels.title": {
    "description": "Section header for deployment models recap"
  },
  "summary.recap.public": "- Public is shared, cost-effective, and easily accessible.",
  "@summary.recap.public": {
    "description": "Full recap item for Public cloud including bullet marker"
  },
  "summary.recap.private": "- Private is dedicated to a single customer for greater security and control.",
  "@summary.recap.private": {
    "description": "Full recap item for Private cloud including bullet marker"
  },
  "summary.recap.hybrid": "- Hybrid combines public and private clouds for flexibility.",
  "@summary.recap.hybrid": {
    "description": "Full recap item for Hybrid cloud including bullet marker"
  },
  "summary.recap.perspective.title": "Perspective Matters:",
  "@summary.recap.perspective.title": {
    "description": "Section header for perspective insight recap"
  },
  "summary.recap.perspective.text": "The same infrastructure can be different service models depending on your role (Netflix uses PaaS, subscribers use SaaS).",
  "@summary.recap.perspective.text": {
    "description": "Summary of the perspective insight from Part 4"
  },
  "summary.recap.application.title": "Real-World Application:",
  "@summary.recap.application.title": {
    "description": "Section header for application skills recap"
  },
  "summary.recap.application.text": "When designing cloud solutions, consider security needs, cost constraints, and how usage might change over time.",
  "@summary.recap.application.text": {
    "description": "Summary of practical application skills from Part 5"
  },
  "summary.score": "Your Score: {totalScore, number} / {maxScore, number}",
  "@summary.score": {
    "description": "Display of user's total score. totalScore and maxScore are numeric values showing points earned out of total possible"
  },
  "summary.button.restart": "Try Again",
  "@summary.button.restart": {
    "description": "Button to restart the activity from the beginning"
  },
  "servicemodel.iaas": "Infrastructure as a Service (IaaS)",
  "@servicemodel.iaas": {
    "description": "Full name of IaaS service model category. This is a technical term - translate the words but keep the acronym IaaS"
  },
  "servicemodel.paas": "Platform as a Service (PaaS)",
  "@servicemodel.paas": {
    "description": "Full name of PaaS service model category. This is a technical term - translate the words but keep the acronym PaaS"
  },
  "servicemodel.saas": "Software as a Service (SaaS)",
  "@servicemodel.saas": {
    "description": "Full name of SaaS service model category. This is a technical term - translate the words but keep the acronym SaaS"
  },
  "deploymentmodel.public": "Public Cloud",
  "@deploymentmodel.public": {
    "description": "Name of public cloud deployment model"
  },
  "deploymentmodel.private": "Private Cloud",
  "@deploymentmodel.private": {
    "description": "Name of private cloud deployment model"
  },
  "deploymentmodel.hybrid": "Hybrid Cloud",
  "@deploymentmodel.hybrid": {
    "description": "Name of hybrid cloud deployment model"
  },
  "part4.title": "Part 4: Perspective Matters",
  "@part4.title": {
    "description": "Header for the Netflix perspective-switching section"
  },
  "part4.subtitle": "The same cloud infrastructure can be different service models depending on your role.",
  "@part4.subtitle": {
    "description": "Educational explanation of perspective in service models"
  },
  "part4.instructions": "Click the buttons below to switch between Netflix's perspective and a subscriber's perspective:",
  "@part4.instructions": {
    "description": "Instructions for the interactive perspective switcher"
  },
  "part4.button.netflix": "Netflix's View",
  "@part4.button.netflix": {
    "description": "Button to switch to Netflix company perspective"
  },
  "part4.button.subscriber": "Subscriber's View",
  "@part4.button.subscriber": {
    "description": "Button to switch to subscriber/user perspective"
  },
  "part4.netflix.role": "Role: Content Provider",
  "@part4.netflix.role": {
    "description": "Label showing Netflix's business role"
  },
  "part4.netflix.service": "Service Model: Platform as a Service (PaaS)",
  "@part4.netflix.service": {
    "description": "Service model from Netflix company's perspective - PaaS"
  },
  "part4.netflix.pays": "Netflix Pays For:",
  "@part4.netflix.pays": {
    "description": "Header for what Netflix company pays for"
  },
  "part4.netflix.pay1": "Hosting their streaming application",
  "@part4.netflix.pay1": {
    "description": "First item Netflix pays for - application hosting"
  },
  "part4.netflix.pay2": "Storage for their video library",
  "@part4.netflix.pay2": {
    "description": "Second item Netflix pays for - content storage"
  },
  "part4.netflix.pay3": "Bandwidth for streaming to millions",
  "@part4.netflix.pay3": {
    "description": "Third item Netflix pays for - network bandwidth"
  },
  "part4.netflix.manages": "Netflix Manages:",
  "@part4.netflix.manages": {
    "description": "Header for what Netflix company manages"
  },
  "part4.netflix.manage1": "Their streaming software",
  "@part4.netflix.manage1": {
    "description": "First item Netflix manages - their own software"
  },
  "part4.netflix.manage2": "Content library and recommendations",
  "@part4.netflix.manage2": {
    "description": "Second item Netflix manages - content and algorithms"
  },
  "part4.netflix.manage3": "User accounts and billing",
  "@part4.netflix.manage3": {
    "description": "Third item Netflix manages - user management"
  },
  "part4.netflix.provider": "Cloud Provider Manages:",
  "@part4.netflix.provider": {
    "description": "Header for what cloud provider manages for Netflix"
  },
  "part4.netflix.provider1": "Servers and infrastructure",
  "@part4.netflix.provider1": {
    "description": "First item cloud provider manages - servers"
  },
  "part4.netflix.provider2": "Security and updates",
  "@part4.netflix.provider2": {
    "description": "Second item cloud provider manages - security"
  },
  "part4.subscriber.role": "Role: End User",
  "@part4.subscriber.role": {
    "description": "Label showing subscriber's role as end user"
  },
  "part4.subscriber.service": "Service Model: Software as a Service (SaaS)",
  "@part4.subscriber.service": {
    "description": "Service model from subscriber's perspective - SaaS"
  },
  "part4.subscriber.pays": "You Pay For:",
  "@part4.subscriber.pays": {
    "description": "Header for what subscriber pays for"
  },
  "part4.subscriber.pay1": "Monthly subscription to access Netflix",
  "@part4.subscriber.pay1": {
    "description": "What subscriber pays for - subscription access"
  },
  "part4.subscriber.gets": "You Get:",
  "@part4.subscriber.gets": {
    "description": "Header for what subscriber receives"
  },
  "part4.subscriber.get1": "Instant access to stream content",
  "@part4.subscriber.get1": {
    "description": "First benefit - instant streaming"
  },
  "part4.subscriber.get2": "No software to install or maintain",
  "@part4.subscriber.get2": {
    "description": "Second benefit - no installation needed"
  },
  "part4.subscriber.get3": "Works on any device with internet",
  "@part4.subscriber.get3": {
    "description": "Third benefit - multi-device access"
  },
  "part4.subscriber.notneed": "You Don't Need to Know About:",
  "@part4.subscriber.notneed": {
    "description": "Header for complexity hidden from subscriber"
  },
  "part4.subscriber.notneed1": "Where the servers are located",
  "@part4.subscriber.notneed1": {
    "description": "First hidden complexity - server location"
  },
  "part4.subscriber.notneed2": "How the infrastructure works",
  "@part4.subscriber.notneed2": {
    "description": "Second hidden complexity - infrastructure details"
  },
  "part4.insight": "Key Insight: Netflix uses PaaS to run their business, but provides SaaS to you. The same infrastructure serves different purposes!",
  "@part4.insight": {
    "description": "Educational insight explaining the dual perspective"
  },
  "part4.insight.label": "Key Insight",
  "@part4.insight.label": {
    "description": "Label for the educational insight callout box"
  },
  "part4.progress.label": "Explore both perspectives",
  "@part4.progress.label": {
    "description": "Instruction to view both Netflix and Subscriber perspectives"
  },
  "part4.progress.viewed": "Viewed: {count} of 2",
  "@part4.progress.viewed": {
    "description": "Progress counter showing how many perspectives have been explored. {count} is a number (1 or 2)"
  },
  "part4.button.continue": "Continue to Cloud Designer",
  "@part4.button.continue": {
    "description": "Button to proceed to Part 5"
  },
  "part5.title": "Cloud Design Activity",
  "@part5.title": {
    "description": "Header for the interactive cloud solution designer section where learners apply their knowledge"
  },
  "part5.description": "Choose a service model and a deployment model for each scenario. Adjust the users to see trade‑offs. Then evaluate your pick.",
  "@part5.description": {
    "description": "Instructions explaining the interactive activity: select models, adjust scale, and evaluate choices"
  },
  "part5.scenario.label": "Scenario {current, number} of {total, number}",
  "@part5.scenario.label": {
    "description": "Progress indicator showing which scenario learner is on. current and total are numeric values"
  },
  "part5.scenario.pill.users": "Users: {count, number}",
  "@part5.scenario.pill.users": {
    "description": "Pill badge showing current user count. count is a numeric value that should be formatted with thousands separators"
  },
  "part5.scenario.pill.weights": "Weights → Cost {cost, number}%, Perf {perf, number}%, Compliance {compliance, number}%, Effort {effort, number}%",
  "@part5.scenario.pill.weights": {
    "description": "Pill badge showing scenario weight distribution across evaluation criteria. All values are percentages. Perf is short for Performance"
  },
  "part5.scenario1.title": "Viral Mobile App Launch",
  "@part5.scenario1.title": {
    "description": "Title for first scenario: a startup launching a consumer mobile app with uncertain growth"
  },
  "part5.scenario1.description": "You're a small team launching a new consumer app. User growth is uncertain and potentially spiky. You need to ship fast and keep costs sensible at low/medium scale.",
  "@part5.scenario1.description": {
    "description": "Business scenario description for mobile app startup emphasizing speed to market, uncertain scaling, and cost consciousness"
  },
  "part5.scenario2.title": "Hospital Patient Portal (PHI)",
  "@part5.scenario2.title": {
    "description": "Title for second scenario: healthcare system with strict security requirements. PHI is an acronym for Protected Health Information - a regulatory term"
  },
  "part5.scenario2.description": "A healthcare provider needs to store and process PHI. Compliance and control matter most, but the portal must still scale during seasonal surges.",
  "@part5.scenario2.description": {
    "description": "Business scenario description for healthcare emphasizing regulatory compliance, security, and controlled scaling. PHI (Protected Health Information) is sensitive medical data"
  },
  "part5.scenario3.title": "Internal CRM for a Sales Team",
  "@part5.scenario3.title": {
    "description": "Title for third scenario: internal business system for sales team. CRM is an acronym for Customer Relationship Management"
  },
  "part5.scenario3.description": "You need CRM functionality for ~500–5,000 employees. Time‑to‑value and reliability are key; deep customization is less important than getting a proven system.",
  "@part5.scenario3.description": {
    "description": "Business scenario description for internal CRM emphasizing quick deployment and proven reliability over customization. CRM = Customer Relationship Management software"
  },
  "part5.service.heading": "1) Choose a Service Model",
  "@part5.service.heading": {
    "description": "Step 1 heading for service model selection (IaaS/PaaS/SaaS)"
  },
  "part5.service.iaas.label": "IaaS (build & run VMs/containers)",
  "@part5.service.iaas.label": {
    "description": "Label for Infrastructure as a Service option. IaaS is a technical acronym - translate the words but keep IaaS. VMs = Virtual Machines (do not translate). Containers refers to containerized applications"
  },
  "part5.service.iaas.blurb": "You manage OS/runtime and scaling. Highest control and flexibility; slower to ship; more ops work.",
  "@part5.service.iaas.blurb": {
    "description": "Description of IaaS: emphasizes user responsibility for management, high control/flexibility, longer time to market, and increased operational overhead. OS = Operating System, ops = operations"
  },
  "part5.service.iaas.shortLabel": "IaaS",
  "@part5.service.iaas.shortLabel": {
    "description": "Short label for IaaS used in explanations and comparisons. Keep as IaaS (the acronym)"
  },
  "part5.service.paas.label": "PaaS (managed app platform)",
  "@part5.service.paas.label": {
    "description": "Label for Platform as a Service option. PaaS is a technical acronym - translate the words but keep PaaS"
  },
  "part5.service.paas.blurb": "You push code; platform handles runtime, scaling, and much of ops. Good balance of speed and control.",
  "@part5.service.paas.blurb": {
    "description": "Description of PaaS: emphasizes developer convenience, automatic scaling, and balanced trade-offs. ops = operations"
  },
  "part5.service.paas.shortLabel": "PaaS",
  "@part5.service.paas.shortLabel": {
    "description": "Short label for PaaS used in explanations and comparisons. Keep as PaaS (the acronym)"
  },
  "part5.service.saas.label": "SaaS (use an existing product)",
  "@part5.service.saas.label": {
    "description": "Label for Software as a Service option. SaaS is a technical acronym - translate the words but keep SaaS"
  },
  "part5.service.saas.blurb": "You subscribe to software someone else runs. Fastest time‑to‑value; least control/customization.",
  "@part5.service.saas.blurb": {
    "description": "Description of SaaS: emphasizes subscription model, quickest deployment, minimal control and customization options"
  },
  "part5.service.saas.shortLabel": "SaaS",
  "@part5.service.saas.shortLabel": {
    "description": "Short label for SaaS used in explanations and comparisons. Keep as SaaS (the acronym)"
  },
  "part5.service.pill.ops": "Ops overhead: {cost}",
  "@part5.service.pill.ops": {
    "description": "Pill badge showing operational overhead cost. cost is already formatted as currency (e.g., '$6,000/mo'). ops = operations"
  },
  "part5.service.pill.lockin": "Lock‑in: {risk}",
  "@part5.service.pill.lockin": {
    "description": "Pill badge showing vendor lock-in risk level. The risk variable is already translated. Lock-in refers to difficulty switching providers"
  },
  "part5.risk.low": "low",
  "@part5.risk.low": {
    "description": "Label for low vendor lock-in risk level"
  },
  "part5.risk.med": "med",
  "@part5.risk.med": {
    "description": "Label for medium vendor lock-in risk level. Use appropriate abbreviation or word for 'medium' in your language"
  },
  "part5.risk.high": "high",
  "@part5.risk.high": {
    "description": "Label for high vendor lock-in risk level"
  },
  "part5.currency.monthly": "${amount, number}/mo",
  "@part5.currency.monthly": {
    "description": "Format for displaying monthly cost. The amount variable is a raw number that will be formatted according to your locale. Adapt currency symbol and '/mo' (per month) to your locale"
  },
  "part5.deployment.heading": "2) Choose a Deployment Model",
  "@part5.deployment.heading": {
    "description": "Step 2 heading for deployment model selection (Public/Private/Hybrid)"
  },
  "part5.deployment.public.label": "Public Cloud",
  "@part5.deployment.public.label": {
    "description": "Label for Public Cloud deployment option - shared infrastructure accessible over internet"
  },
  "part5.deployment.public.blurb": "Elastic capacity with pay‑as‑you‑go. Great for spiky workloads and faster global reach.",
  "@part5.deployment.public.blurb": {
    "description": "Description of Public Cloud: emphasizes scalability, usage-based pricing, handling traffic spikes, and worldwide availability"
  },
  "part5.deployment.public.shortLabel": "public cloud",
  "@part5.deployment.public.shortLabel": {
    "description": "Short lowercase label for Public Cloud used in explanations. Translate to lowercase form appropriate for your language"
  },
  "part5.deployment.private.label": "Private Cloud / On‑Prem",
  "@part5.deployment.private.label": {
    "description": "Label for Private Cloud deployment option. On‑Prem is short for On-Premises - infrastructure in your own data center"
  },
  "part5.deployment.private.blurb": "Dedicated resources and higher control. Good for strict compliance; capacity must be planned.",
  "@part5.deployment.private.blurb": {
    "description": "Description of Private Cloud: emphasizes dedicated infrastructure, security/compliance benefits, and need for capacity planning"
  },
  "part5.deployment.private.shortLabel": "private cloud",
  "@part5.deployment.private.shortLabel": {
    "description": "Short lowercase label for Private Cloud used in explanations. Translate to lowercase form appropriate for your language"
  },
  "part5.deployment.hybrid.label": "Hybrid",
  "@part5.deployment.hybrid.label": {
    "description": "Label for Hybrid Cloud deployment option - combination of public and private infrastructure"
  },
  "part5.deployment.hybrid.blurb": "Mix of private plus public burst. Strikes a balance: control where needed, elasticity for peaks.",
  "@part5.deployment.hybrid.blurb": {
    "description": "Description of Hybrid Cloud: emphasizes combining private infrastructure for baseline with public cloud for peak demand"
  },
  "part5.deployment.hybrid.shortLabel": "hybrid cloud",
  "@part5.deployment.hybrid.shortLabel": {
    "description": "Short lowercase label for Hybrid Cloud used in explanations. Translate to lowercase form appropriate for your language"
  },
  "part5.deployment.pill.fixed": "Fixed: {cost}",
  "@part5.deployment.pill.fixed": {
    "description": "Pill badge showing fixed infrastructure costs. cost is already formatted as currency (e.g., '$12,000/mo')"
  },
  "part5.deployment.pill.variable": "+ ${cost}/1k users",
  "@part5.deployment.pill.variable": {
    "description": "Pill badge showing variable cost per thousand users. cost is a number that should be formatted (e.g., '180' becomes '+ $180/1k users')"
  },
  "part5.deployment.pill.elasticity": "Elasticity {score}/100",
  "@part5.deployment.pill.elasticity": {
    "description": "Pill badge showing elasticity score (ability to scale dynamically). score is a number from 0-100, higher is better"
  },
  "part5.scale.heading": "3) Adjust Scale",
  "@part5.scale.heading": {
    "description": "Step 3 heading for user count slider control"
  },
  "part5.scale.users": "Active users: {count, number}",
  "@part5.scale.users": {
    "description": "Label showing selected user count. count is a numeric value that should be formatted with thousands separators"
  },
  "part5.tradeoffs.heading": "4) See Trade‑offs",
  "@part5.tradeoffs.heading": {
    "description": "Step 4 heading for metrics and comparison section"
  },
  "part5.tradeoffs.button.hide": "Hide compare‑all table",
  "@part5.tradeoffs.button.hide": {
    "description": "Button text to hide the comparison table showing all 9 service/deployment combinations"
  },
  "part5.tradeoffs.button.show": "Show compare‑all table",
  "@part5.tradeoffs.button.show": {
    "description": "Button text to show the comparison table showing all 9 service/deployment combinations"
  },
  "part5.tradeoffs.selection.label": "Your selection:",
  "@part5.tradeoffs.selection.label": {
    "description": "Label introducing the learner's selected service and deployment combination"
  },
  "part5.tradeoffs.cost.label": "Estimated monthly cost:",
  "@part5.tradeoffs.cost.label": {
    "description": "Label for estimated monthly cost display"
  },
  "part5.tradeoffs.metric.performance": "Scale & Performance",
  "@part5.tradeoffs.metric.performance": {
    "description": "Label for performance/scalability metric bar - measures ability to handle user load and growth"
  },
  "part5.tradeoffs.metric.compliance": "Compliance & Control",
  "@part5.tradeoffs.metric.compliance": {
    "description": "Label for compliance/control metric bar - measures security, regulatory compliance, and organizational control"
  },
  "part5.tradeoffs.metric.ease": "Ease of Operations",
  "@part5.tradeoffs.metric.ease": {
    "description": "Label for operational ease metric bar - measures how much effort is required to manage and maintain the solution"
  },
  "part5.tradeoffs.explain.heading": "Why it scores this way:",
  "@part5.tradeoffs.explain.heading": {
    "description": "Heading for explanatory bullet points that break down how metrics are calculated"
  },
  "part5.tradeoffs.fit.label": "Fit Score (weighted for this scenario):",
  "@part5.tradeoffs.fit.label": {
    "description": "Label for overall fit score - a weighted combination of all metrics based on scenario priorities"
  },
  "part5.tradeoffs.noselection": "Choose a service model and a deployment model to see detailed trade‑offs.",
  "@part5.tradeoffs.noselection": {
    "description": "Placeholder message shown when no service/deployment combination is selected yet"
  },
  "part5.top.heading": "Top recommended option",
  "@part5.top.heading": {
    "description": "Heading for the panel showing the highest-ranked solution for the current scenario"
  },
  "part5.top.badge": "Highest Fit Score",
  "@part5.top.badge": {
    "description": "Badge text indicating this is the top-ranked option based on fit score"
  },
  "part5.top.cost.label": "Cost:",
  "@part5.top.cost.label": {
    "description": "Label for cost in the top recommendation panel (shortened for space)"
  },
  "part5.top.fit.label": "Fit:",
  "@part5.top.fit.label": {
    "description": "Label for fit score in the top recommendation panel (shortened for space)"
  },
  "part5.table.rank": "Rank",
  "@part5.table.rank": {
    "description": "Table header for ranking column (1st, 2nd, 3rd, etc.)"
  },
  "part5.table.option": "Option",
  "@part5.table.option": {
    "description": "Table header for service/deployment combination column"
  },
  "part5.table.cost": "Cost",
  "@part5.table.cost": {
    "description": "Table header for monthly cost column"
  },
  "part5.table.perf": "Perf",
  "@part5.table.perf": {
    "description": "Table header for performance metric column. Short for Performance to save space"
  },
  "part5.table.compliance": "Compliance",
  "@part5.table.compliance": {
    "description": "Table header for compliance/control metric column"
  },
  "part5.table.ease": "Ease",
  "@part5.table.ease": {
    "description": "Table header for operational ease metric column"
  },
  "part5.table.fit": "Fit",
  "@part5.table.fit": {
    "description": "Table header for overall fit score column"
  },
  "part5.table.note": "Fit = weighted combination of affordability (cheaper is better), performance, compliance/control, and ease of operations, using scenario weights above.",
  "@part5.table.note": {
    "description": "Explanatory note below comparison table explaining how the fit score is calculated from weighted metrics"
  },
  "part5.button.evaluate": "Evaluate my choice",
  "@part5.button.evaluate": {
    "description": "Button to submit selection and receive feedback on how well it fits the scenario"
  },
  "part5.button.next": "Next scenario",
  "@part5.button.next": {
    "description": "Button to proceed to next business scenario after evaluation"
  },
  "part5.button.finish": "Finish",
  "@part5.button.finish": {
    "description": "Button to complete Part 5 and view final summary after last scenario"
  },
  "part5.explanation.cost": "Cost combines {deploymentLabel} infra {infraCost} + {serviceLabel} platform/ops {platformCost}.",
  "@part5.explanation.cost": {
    "description": "Explanation of how total cost is calculated from infrastructure and platform/ops costs. deploymentLabel=deployment type, infraCost=monthly infra cost, serviceLabel=service type, platformCost=monthly ops cost"
  },
  "part5.explanation.performance.private": "{deploymentLabel} elasticity ({elasticity}/100) drops more near peak without capacity planning, so at {loadPercent}% of peak your performance score is {perfScore}.",
  "@part5.explanation.performance.private": {
    "description": "Explanation of performance score for Private cloud deployment. elasticity=elasticity rating, loadPercent=current load as percentage of max, perfScore=calculated performance score"
  },
  "part5.explanation.performance.public": "{deploymentLabel} elasticity ({elasticity}/100) handles spikes better, so at {loadPercent}% of peak your performance score is {perfScore}.",
  "@part5.explanation.performance.public": {
    "description": "Explanation of performance score for Public/Hybrid cloud deployment. elasticity=elasticity rating, loadPercent=current load as percentage of max, perfScore=calculated performance score"
  },
  "part5.explanation.compliance": "Compliance/control is influenced by {deploymentLabel} ({baseCompliance}/100) and {serviceLabel} control bonus ({controlBonus, number, :: sign-always}).",
  "@part5.explanation.compliance": {
    "description": "Explanation of compliance/control score calculation. deploymentLabel=deployment type, baseCompliance=base compliance rating, serviceLabel=service type, controlBonus=signed number. The :: sign-always ICU syntax forces sign display for translators to control formatting"
  },
  "part5.explanation.effort": "Operational effort is mostly driven by the service model; {serviceLabel} implies {effortScore}/100 effort (lower ease).",
  "@part5.explanation.effort": {
    "description": "Explanation of operational effort score for non-hybrid deployments. serviceLabel=service type, effortScore=effort level"
  },
  "part5.explanation.effort.hybrid": "Operational effort is mostly driven by the service model; {serviceLabel} implies {effortScore}/100 effort (lower ease). Hybrid adds some integration overhead.",
  "@part5.explanation.effort.hybrid": {
    "description": "Explanation of operational effort score for hybrid deployment. serviceLabel=service type, effortScore=effort level. Includes note about hybrid integration overhead. Translators control full sentence structure"
  },
  "part5.feedback.excellent": "✅ Excellent — you chose the top‑ranked option for this scenario.",
  "@part5.feedback.excellent": {
    "description": "Positive feedback when learner selects the #1 ranked option with highest fit score"
  },
  "part5.feedback.solid": "👍 Solid — your pick is among the top three for this scenario.",
  "@part5.feedback.solid": {
    "description": "Positive feedback when learner selects one of the top 3 ranked options"
  },
  "part5.feedback.reasonable": "💡 Reasonable, but there are options that fit better for this scenario.",
  "@part5.feedback.reasonable": {
    "description": "Constructive feedback when learner selects a lower-ranked option that could be improved"
  },
  "part5.feedback.details": "Your Fit Score: {yourFit, number}/100. Top option: {topService} + {topDeployment} ({topFit, number}/100).",
  "@part5.feedback.details": {
    "description": "Detailed feedback showing learner's fit score compared to the top option. yourFit and topFit are numeric scores, topService and topDeployment are text like 'PaaS' and 'Public Cloud'"
  },
  "part5.feedback.helping.label": "Factors helping your choice:",
  "@part5.feedback.helping.label": {
    "description": "Label for list of strengths in the selected solution"
  },
  "part5.feedback.helping.none": "none highlighted",
  "@part5.feedback.helping.none": {
    "description": "Text shown when no specific factors are strong enough to highlight as helping"
  },
  "part5.feedback.helping.performance": "performance",
  "@part5.feedback.helping.performance": {
    "description": "Factor name: performance/scalability is a strength of this choice (used in comma-separated list)"
  },
  "part5.feedback.helping.compliance": "compliance",
  "@part5.feedback.helping.compliance": {
    "description": "Factor name: compliance/control is a strength of this choice (used in comma-separated list)"
  },
  "part5.feedback.helping.effort": "low ops effort",
  "@part5.feedback.helping.effort": {
    "description": "Factor name: low operational effort is a strength of this choice (used in comma-separated list). ops = operations"
  },
  "part5.feedback.hurting.label": "Factors hurting your choice:",
  "@part5.feedback.hurting.label": {
    "description": "Label for list of weaknesses in the selected solution"
  },
  "part5.feedback.hurting.none": "none highlighted",
  "@part5.feedback.hurting.none": {
    "description": "Text shown when no specific factors are weak enough to highlight as hurting"
  },
  "part5.feedback.hurting.performance": "performance",
  "@part5.feedback.hurting.performance": {
    "description": "Factor name: performance/scalability is a weakness of this choice (used in comma-separated list)"
  },
  "part5.feedback.hurting.compliance": "compliance",
  "@part5.feedback.hurting.compliance": {
    "description": "Factor name: compliance/control is a weakness of this choice (used in comma-separated list)"
  },
  "part5.feedback.hurting.effort": "ops effort",
  "@part5.feedback.hurting.effort": {
    "description": "Factor name: high operational effort is a weakness of this choice (used in comma-separated list). ops = operations"
  },
  "part5.tip": "Tip for teachers: Encourage learners to toggle \"Compare‑all\" and move the user slider to see how rankings change as scale grows. Ask: \"When would you pick Hybrid over Public? Why is SaaS ideal for internal CRM?\"",
  "@part5.tip": {
    "description": "Pedagogical tip for educators on how to facilitate deeper learning. CRM = Customer Relationship Management. This tip encourages exploration and critical thinking questions"
  },
  "progress.label": "Learning journey navigation",
  "@progress.label": {
    "description": "ARIA label for the progress navigation bar"
  },
  "progress.introduction.title": "Intro",
  "@progress.introduction.title": {
    "description": "Short title for introduction stage in progress bar"
  },
  "progress.introduction.label": "Navigate to Introduction",
  "@progress.introduction.label": {
    "description": "ARIA label for introduction navigation button"
  },
  "progress.part1.title": "Part 1",
  "@progress.part1.title": {
    "description": "Short title for Part 1: Foundations in progress bar"
  },
  "progress.part1.label": "Navigate to Part 1: Foundations",
  "@progress.part1.label": {
    "description": "ARIA label for Part 1 navigation button"
  },
  "progress.part2.title": "Part 2",
  "@progress.part2.title": {
    "description": "Short title for Part 2: Service Models in progress bar"
  },
  "progress.part2.label": "Navigate to Part 2: Service Models",
  "@progress.part2.label": {
    "description": "ARIA label for Part 2 navigation button"
  },
  "progress.part3.title": "Part 3",
  "@progress.part3.title": {
    "description": "Short title for Part 3: Deployment Models in progress bar"
  },
  "progress.part3.label": "Navigate to Part 3: Deployment Models",
  "@progress.part3.label": {
    "description": "ARIA label for Part 3 navigation button"
  },
  "progress.part4.title": "Part 4",
  "@progress.part4.title": {
    "description": "Short title for Part 4: Perspective Matters in progress bar"
  },
  "progress.part4.label": "Navigate to Part 4: Perspective Matters",
  "@progress.part4.label": {
    "description": "ARIA label for Part 4 navigation button"
  },
  "progress.part5.title": "Part 5",
  "@progress.part5.title": {
    "description": "Short title for Part 5: Cloud Designer in progress bar"
  },
  "progress.part5.label": "Navigate to Part 5: Cloud Solution Designer",
  "@progress.part5.label": {
    "description": "ARIA label for Part 5 navigation button"
  },
  "progress.summary.title": "Summary",
  "@progress.summary.title": {
    "description": "Short title for summary/results stage in progress bar"
  },
  "progress.summary.label": "Navigate to Summary and Results",
  "@progress.summary.label": {
    "description": "ARIA label for summary navigation button"
  },
  "progress.introduction.subtitle": "Getting Started",
  "@progress.introduction.subtitle": {
    "description": "Subtitle shown under the Intro progress stage"
  },
  "progress.part1.subtitle": "Foundations",
  "@progress.part1.subtitle": {
    "description": "Subtitle shown under the Part 1 progress stage - about cloud computing basics"
  },
  "progress.part2.subtitle": "Service Models",
  "@progress.part2.subtitle": {
    "description": "Subtitle shown under the Part 2 progress stage - about IaaS, PaaS, SaaS"
  },
  "progress.part3.subtitle": "Deployment Models",
  "@progress.part3.subtitle": {
    "description": "Subtitle shown under the Part 3 progress stage - about Public, Private, Hybrid"
  },
  "progress.part4.subtitle": "Perspective Matters",
  "@progress.part4.subtitle": {
    "description": "Subtitle shown under the Part 4 progress stage - about Netflix case study"
  },
  "progress.part5.subtitle": "Cloud Designer",
  "@progress.part5.subtitle": {
    "description": "Subtitle shown under the Part 5 progress stage - about applying knowledge to scenarios"
  },
  "progress.summary.subtitle": "Your Results",
  "@progress.summary.subtitle": {
    "description": "Subtitle shown under the Summary progress stage - final score and recap"
  }
}
